Unfortunately the issue persist in localstack-pro:latest image, I have just tried again and have the exact same result:

` tflocal apply -target aws_db_option_group.rds_mssql
aws_db_option_group.rds_mssql: Refreshing state... [id=option-group-test-terraform]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_db_option_group.rds_mssql is tainted, so must be replaced
-/+ resource "aws_db_option_group" "rds_mssql" {
      ~ arn                      = "arn:aws:rds:eu-west-1:000000000000:og:option-group-test-terraform" -> (known after apply)
      ~ id                       = "option-group-test-terraform" -> (known after apply)
        name                     = "option-group-test-terraform"
      + name_prefix              = (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (3 unchanged attributes hidden)

      + option {
          + db_security_group_memberships  = []
          + option_name                    = "SQLSERVER_BACKUP_RESTORE"
          + vpc_security_group_memberships = []

          + option_settings {
              + name  = "IAM_ROLE_ARN"
              + value = "arn"
            }
        }
      + option {
          + db_security_group_memberships  = []
          + option_name                    = "TDE"
          + vpc_security_group_memberships = []
        }
      + option {
          + db_security_group_memberships  = []
          + option_name                    = "Timezone"
          + vpc_security_group_memberships = []

          + option_settings {
              + name  = "TIME_ZONE"
              + value = "UTC"
            }
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.
╷
│ Warning: Resource targeting is in effect
│ 
│ You are creating a plan with the -target option, which means that the result of this plan may not represent all of the changes requested by the current configuration.
│ 
│ The -target option is not for routine use, and is provided only for exceptional situations such as recovering from errors or mistakes, or when Terraform specifically suggests to use it as part of an error
│ message.
╵

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_db_option_group.rds_mssql: Destroying... [id=option-group-test-terraform]
aws_db_option_group.rds_mssql: Destruction complete after 0s
aws_db_option_group.rds_mssql: Creating...
╷
│ Warning: Applied changes may be incomplete
│ 
│ The plan was created with the -target option in effect, so some changes requested in the configuration may have been ignored and the output values may not be fully updated. Run the following command to verify
│ that no other changes are pending:
│     terraform plan
│ 	
│ Note that the -target option is not suitable for routine use, and is provided only for exceptional situations such as recovering from errors or mistakes, or when Terraform specifically suggests to use it as
│ part of an error message.
╵
╷
│ Error: modifying DB Option Group: InvalidParameterValue: At least one option must be added, modified, or removed.
│ 	status code: 400, request id: 9V1...
│ 
│   with aws_db_option_group.rds_mssql,
│   on main.tf line 747, in resource "aws_db_option_group" "rds_mssql":
│  747: resource "aws_db_option_group" "rds_mssql" {
│ 
╵`